mistyk/inavradar-ESP32/src/main.cpp
void planeFakeWP () {
    msp_set_wp_t wp;
    if (cfg.debugFakeMoving && moving > 100) {
      moving = 0;
    }
    if (!cfg.debugFakeMoving) {
      moving = 0;
    }

    if (pd.gps.fixType > 0) {
      wp.waypointNumber = 1;
      wp.action = MSP_NAV_STATUS_WAYPOINT_ACTION_WAYPOINT;
      wp.lat = homepos.lat-100 + (moving * 20);
      wp.lon = homepos.lon;
      wp.alt = homepos.alt + 300;
      wp.p1 = 1000;
      wp.p2 = 0;
      wp.p3 = 1;
      wp.flag = 0xa5;
      msp.command(MSP_SET_WP, &wp, sizeof(wp));
      cliLog("Fake POIs sent to FC.");
    } else {
      cliLog("Fake POIs waiting for GPS fix.");
    }
}

void initMSP () {
  cliLog("Starting MSP ...");
  display.drawString (0, 16, "MSP ");
  display.display();
  delay(200);
  Serial1.begin(57600, SERIAL_8N1, cfg.mspRX , cfg.mspTX);
  msp.begin(Serial1);
  cliLog("MSP started!");
  display.drawString (100, 16, "OK");
  display.display();
  display.drawString (0, 24, "FC ");
  display.display();
  cliLog("Waiting for FC to start ...");
  delay(cfg.fcTimeout*1000);
  getPlaneData();
  getPlaneGPS();
  cliLog("FC detected: " + String(planeFC));
  display.drawString (100, 24, planeFC);
  display.display();
}
// ----------------------------------------------------------------------------- main init

const byte interruptPin = 0;
volatile int interruptCounter = 0;
int numberOfInterrupts = 0;

portMUX_TYPE mux = portMUX_INITIALIZER_UNLOCKED;

void IRAM_ATTR handleInterrupt() {
  portENTER_CRITICAL_ISR(&mux);
  if (buttonPressed == 0) {
    buttonPressed = 1;
    if (displayPage >= 1) displayPage = 0;
    else displayPage++;
    //drawDisplay();
    lastDebounceTime = millis();
  }
  portEXIT_CRITICAL_ISR(&mux);
}

void setup() {
  Serial.begin(115200);
  serialConsole[0] = &Serial;
  initCli();
  initConfig();
  initDisplay();
  initLora();
  delay(1500);
  initMSP();
  delay(1000);
  pinMode(interruptPin, INPUT);
  buttonPressed = 0;
  attachInterrupt(digitalPinToInterrupt(interruptPin), handleInterrupt, RISING);

  for (size_t i = 0; i <= 4; i++) {
    pds[i].waypointNumber = 0;
  }
  booted = 1;
  serialConsole[0]->print("> ");
}

// ----------------------------------------------------------------------------- main loop
void loop() {
  if ( (millis() - lastDebounceTime) > 150 && buttonPressed == 1) buttonPressed = 0;

  if (millis() - displayLastTime > cfg.intervalDisplay) {
    drawDisplay();
    readCli();

    loraTX = 0;
    loraRX = 0;
    displayLastTime = millis();
  }

  if (millis() - pdLastTime > cfg.intervalStatus) {
    numPlanes = 0;
    pps = ppsc;
    ppsc = 0;
    for (size_t i = 0; i <= 4; i++) {
      if (pds[i].waypointNumber != 0) numPlanes++;
      //if (pd.gps.fixType != 0) pds[i].distance = distanceEarth(pd.gps.lat/10000000, pd.gps.lon/10000000, pds[i].pd.gps.lat/10000000, pds[i].pd.gps.lon/10000000);
      if (pds[i].waypointNumber != 0 && millis() - pds[i].lastUpdate > cfg.uavTimeout*1000 ) { // plane timeout
        pds[i].pd.state = 2;
        planeSetWP();
        planeSetWP();
        pds[i].waypointNumber = 0;
        rssi = "0";
        String("").toCharArray(pds[i].pd.planeName,20);
        cliLog("UAV DB delete POI #" + String(i+1));
      }
    }
    //getPlaneStatusEx();
    if (String(pd.planeName) != "No Name" ) {
      getPlaneData();
      getPlanetArmed();
      getPlaneBat();
      if (!pd.state) {
        getPlaneGPS();
        if (pd.gps.fixType != 0) {
          homepos = pd.gps;
          sendMessage(&pd);
          loraTX = 1;
        }
        LoRa.receive();
      }
    }
    pdLastTime = millis();
  }

  if ((millis() - sendLastTime) > cfg.intervalSend ) {
    sendLastTime = millis()+ random(0, 50);
    if (String(pd.planeName) != "No Name" ) {
      if (pd.state) {
        getPlaneGPS();
        loraTX = 1;
        if (pd.gps.fixType != 0) {
          if (loraSeqNum < 255) loraSeqNum++;
          else loraSeqNum = 0;
          pd.seqNum = loraSeqNum;
          sendMessage(&pd);
          LoRa.receive();
        }
      }
      //if (pd.armState) planeSetWP();
      planeSetWP();
      if (cfg.debugFakeWPs) planeFakeWP();
    }
    if (cfg.debugFakePlanes) {
      sendFakePlanes();
      loraTX = 1;
    }
  }
}
